.demo_manifold_3d_model/case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10.0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (10.0 0 0);
    }


    outlet1
    {
        type            zeroGradient;
    }

    outlet2
    {
        type            zeroGradient;
    }

    outlet3
    {
        type            zeroGradient;
    }

    outlet4
    {
        type            zeroGradient;
    }


    walls
    {
        type            noSlip;
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }
}
