.demo_manifold_3d_model/case/system/blockMeshDict
FoamFile { format ascii; class dictionary; object blockMeshDict; }

convertToMeters 1;

vertices
(





    (0 0 0.0)

    (0 0.08776605478 0.0)

    (0 0.1169808365 0.0)

    (0 0.1605641695 0.0)

    (0 0.2 0.0)


    (1 0 0.0)

    (1 0.08776605478 0.0)

    (1 0.1169808365 0.0)

    (1 0.1605641695 0.0)

    (1 0.2 0.0)


    (0 0 0.1)

    (0 0.08776605478 0.1)

    (0 0.1169808365 0.1)

    (0 0.1605641695 0.1)

    (0 0.2 0.1)


    (1 0 0.1)

    (1 0.08776605478 0.1)

    (1 0.1169808365 0.1)

    (1 0.1605641695 0.1)

    (1 0.2 0.1)

);

blocks
(





    hex (
        0
        5
        6
        1
        10
        15
        16
        11
    )
    (120 21 10)
    simpleGrading (1 1 1)

    hex (
        1
        6
        7
        2
        11
        16
        17
        12
    )
    (120 7 10)
    simpleGrading (1 1 1)

    hex (
        2
        7
        8
        3
        12
        17
        18
        13
    )
    (120 10 10)
    simpleGrading (1 1 1)

    hex (
        3
        8
        9
        4
        13
        18
        19
        14
    )
    (120 10 10)
    simpleGrading (1 1 1)

);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces
        (

            (0 1 11 10)

            (1 2 12 11)

            (2 3 13 12)

            (3 4 14 13)

        );
    }


    outlet1
    {
        type patch;
        faces
        (
            (5 15 16 6)
        );
    }

    outlet2
    {
        type patch;
        faces
        (
            (6 16 17 7)
        );
    }

    outlet3
    {
        type patch;
        faces
        (
            (7 17 18 8)
        );
    }

    outlet4
    {
        type patch;
        faces
        (
            (8 18 19 9)
        );
    }


    walls
    {
        type wall;
        faces
        (
            (0 5 15 10)
            (4 14 19 9)
        );
    }

    front
    {
        type symmetryPlane;
        faces
        (

            (0 5 6 1)

            (1 6 7 2)

            (2 7 8 3)

            (3 8 9 4)

        );
    }

    back
    {
        type symmetryPlane;
        faces
        (

            (10 11 16 15)

            (11 12 17 16)

            (12 13 18 17)

            (13 14 19 18)

        );
    }
);

mergePatchPairs ();
