.demo_manifold_3d_model/case/system/fvSchemes
FoamFile { format ascii; class dictionary; object fvSchemes; }

ddtSchemes      { default steadyState; }
gradSchemes     { default Gauss linear; }
divSchemes
{
    default                             none;
    div(phi,U)                          Gauss linearUpwind grad(U);
    div((nuEff*dev2(T(grad(U)))))       Gauss linear;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes   { default corrected; }
wallDist        { method meshWave; }
